package JavaAdvance.Leason4;

import java.util.StringTokenizer;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Task2 {


    public static void main(String[] args) {

        String ANSI_RED = "\u001B[31m";
        String ANSI_RESET = "\u001B[0m";
//        на за не в з за

        String text = "Мотря махнула на себе хусточкою, сіла на призьбі й задумалася. Ілько, пильно слідкуючи за нею, \n " +
                "проти волі задивився на красу її, що тепер іще якось виразніше виявлялася на сірому тлі стіни, \n" +
                "— на ту красу, що не б’є у вічі, що на перший погляд ледве примітна, а тільки в неї вдивишся, можна впитися \n" +
                "й очима, і серцем, всею істотою. То була краса, що виховується тільки на Україні, але не така, як малюють деякі \n" +
                "з наших письменників. Не було в неї ні «губок, як пуп’янок, червоних, як добре намисто», \n" +
                "ні «підборіддя, як горішок», ні «щік, як повна рожа», і сама вона не «вилискувалась, як маківка на городі». \n" +
                "Чорна, без лиску, товста коса; невисокий, трохи випнутий лоб; ніс тонкий, рівний, з живими ніздрями; \n" +
                "свіжі, наче дитячі, губи, що якось мило загинались на кінцях; легка смага на матових, наче мармурових, \n" +
                "щоках і великі, надзвичайно великі, з довгими віями, темно-сірі очі, з яких здавалося, дивлячись, наче \n" +
                "лилося якесь тихе, м’яке, ласкаве світло, — то була й уся краса сієї дівчини (В. Винниченко).\n";

        System.out.println(text);
        System.out.println();
        String java = ANSI_RED + " Java " + ANSI_RESET;

        Pattern pattern = Pattern.compile("\\s+на|за|не|в|з|за\\s\\s");
        Matcher matcher = pattern.matcher(text);

        String newString = matcher.replaceAll(java);
        System.out.println(newString);

    }
}

//Завдання 2
//        Напишіть жартівливу програму «Дешифратор», яка в текстовому файлі могла б замінити всі прийменники слово «Java».