CREATE DATABASE HRDepartment;
USE HRDepartment;

DROP TABLE HRDepartmentTable;
DROP DATABASE HRDepartment;


-- Завдання 4

-- Спроектуйте базу даних для системи відділу кадрів.


CREATE TABLE HRDepartmentTable(

id INT AUTO_INCREMENT NOT NULL,                              -- інкрементарний ід
-- ---------------------------------------------------
-- HR
Відповідальни_співробітник_відділу_HR VARCHAR(20), 														 -- +
ПрізвищеHR VARCHAR(20),																					 -- +
ІмяHR  VARCHAR(20),																					     -- +
ПоБатьковіHR VARCHAR(20),							 													 -- +

-- ---------------------------------------------------
-- Працівник
Дата_прийняття_на_Роботу VARCHAR(10),  					     -- дата коли було прийнято фахівця на роботу   +
Прізвище_працівника VARCHAR(20),							 -- Прізвище 									+
Імя_працівника VARCHAR(20),									 -- Імя											+
По_батькові_працівника VARCHAR(20),							 -- Побатькові									+
Посада VARCHAR(30),                   					     -- Посада яку займає працівник					+
Стать VARCHAR(1),											 -- Стать працівника							+
Дата_народження VARCHAR(10),								 -- Дата народження працівника		
Наявність_дітей BOOLEAN,							    	 -- наявність дітей
Кількість_дітей_до_10_років INT NOT NULL,					 -- Кількість дітей
Номер_телефону VARCHAR(20),									 -- Номер телефону працівника

-- ---------------------------------------------------
-- Додаток
Безпосередній_керівник VARCHAR(20),							 -- ПІБ Керівника 
Департамент VARCHAR(50), 									 -- Структурний підрозділ куди прийнято працівника
ЗП_до_вирахування_податку DOUBLE NOT NULL,       				 -- Сумма заробітної плати
Необхідність_у_додаткових_днях_відпустки BOOLEAN,			 -- Додаткових 7 днів відпустки згідно КЗпП України
Дата_звільнення_з_роботи VARCHAR(10),  						 -- дата коли було звільнено фахівця з роботи   + 
PRIMARY KEY(id)

);

INSERT INTO HRDepartmentTable
(ПрізвищеHR,    ІмяHR,      ПоБатьковіHR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада,         Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент,        ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES 
('Брензейко',  'Оксана',    'Степанівна',   '01/01/2022',             'Юрченко',           'Петро',       'Борисович',            'Frontend Dev.', 'Ч',    '12/03/1990',     false,           7,                           '380976664422', 'Пяточкин П.В.',       'Технічний',         42348.00,                  false,                                   '00/00/0000'),
('Литвинова',  'Людмила',   'Львівна',      '10/02/2021',             'Ющенко',            'Віктор',      'Андрійович',           'SQL Dev.',      'Ч',    '05/12/1980',     true,            1,                           '380667778899', 'Пяточкин П.В.',       'Бізнес аналітики',  17854.20,                  true,                                    '00/00/0000'),
('Садова',     'Наталія',   'Ігорівна',     '12/07/2016',             'Пяточкин',          'Петрик',      'Вадимович',            'CEO',           'Ч',    '12/03/1975',     true,            2,                           '380113366777', 'Пяточкин П.В.',       'Технічний',         129713.00,                 false,                                   '00/00/0000'),
('Онігієнко',  'Юлія',      'Петрівна',     '31/12/2001',             'Чипурко',           'Анастасія',   'Олегівна',             'System Arch.',  'Ж',    '17/07/1963',     true,            2,                           '380097723613', 'Пяточкин П.В.',       'Технічний',         67999.00,                  true,                                    '31/12/2023');

SELECT * FROM HRDepartmentTable;



CREATE TABLE Worker(
idWorker INT AUTO_INCREMENT NOT NULL,                        -- інкрементарний ід
Дата_прийняття_на_Роботу VARCHAR(10),  					     -- дата коли було прийнято фахівця на роботу
Дата_звільнення_з_роботи VARCHAR(10),  						 -- дата коли було звільнено фахівця з роботи
Прізвище_працівника VARCHAR(30),							 -- Прізвище
Імя_працівника VARCHAR(30),									 -- Імя
По_батькові_працівника VARCHAR(30),							 -- Побатькові
Посада VARCHAR(30),                   					     -- Посада яку займає працівник
Стать VARCHAR(1),											 -- Стать працівника
PRIMARY KEY(idWorker)
);

INSERT INTO Worker
( Дата_прийняття_на_Роботу,  	Дата_звільнення_з_роботи,	Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада,          Стать )
VALUES 		
(   		 '01/01/2022',     '00/00/0000'	               ,'Юрченко',           'Петро',        'Борисович',            'Frontend Dev.', 'Ч'  ),
(  		     '10/02/2021',     '00/00/0000'	           	   ,'Ющенко',            'Віктор',       'Андрійович',           'SQL Dev.',      'Ч'  ),
(  		     '12/07/2016',     '00/00/0000'	               ,'Пяточкин',          'Петрик',       'Вадимович',            'CEO',           'Ч'  ),
( 		     '31/12/2001',     '31/12/2023'	               ,'Чипурко',           'Анастасія',    'Олегівна',             'System Arch.',  'Ж'  );

SELECT* FROM Worker;


CREATE TABLE HRSpetialist(
idHR INT AUTO_INCREMENT NOT NULL,                        
ПрізвищеHR VARCHAR(20),
ІмяHR  VARCHAR(20),
ПоБатьковіHR VARCHAR(20),							 
PRIMARY KEY(idHR)
);

INSERT INTO HRSpetialist
( ПрізвищеHR,   ІмяHR,       ПоБатьковіHR  )
VALUES 
('Брензейко',  'Оксана',    'Степанівна'   ),
('Литвинова',  'Людмила',   'Львівна'      ),
('Садова',     'Наталія',   'Ігорівна'     ),
('Онігієнко',  'Юлія',      'Петрівна'     );


SELECT* FROM HRSpetialist;


CREATE TABLE OtherInformation(
idOther INT AUTO_INCREMENT NOT NULL, 
Безпосередній_керівник VARCHAR(20),							 -- ПІБ Керівника
Департамент VARCHAR(50), 									 -- Структурний підрозділ куди прийнято працівника
ЗП_до_вирахування_податку DOUBLE NOT NULL,       		     -- Сумма заробітної плати
Необхідність_у_додаткових_днях_відпустки BOOLEAN,			 -- Додаткових 7 днів відпустки згідно КЗпП України
Дата_народження VARCHAR(10),								 -- Дата народження працівник
Наявність_дітей BOOLEAN,							    	 -- наявність дітей
Кількість_дітей_до_10_років INT NOT NULL,					 -- Кількість дітей
Номер_телефону VARCHAR(20),									 -- Номер телефону працівника
PRIMARY KEY(idOther)
);

INSERT INTO OtherInformation
(Безпосередній_керівник,	Департамент,		ЗП_до_вирахування_податку,	Необхідність_у_додаткових_днях_відпустки,	Дата_народження,	Наявність_дітей,	Кількість_дітей_до_10_років,	Номер_телефону)
VALUES
('Пяточкин П.В.',			'Технічний',		42348.00,					false,										'12/03/1990',		true,				7,								'380976664422'),
('Пяточкин П.В.',			'Бізнес аналітики', 17854.20,					true,										'05/12/1980',		true,				1,								'380667778899'),
('Пяточкин П.В.',			'Технічний',		129713.00,					false,										'12/03/1975',		true,				2,								'380113366777'),
('Пяточкин П.В.',			'Технічний',		67999.00,					true,										'17/07/1963',		true,				2,								'380097723613');

SELECT* FROM OtherInformation;

