CREATE DATABASE HRDepartment;
USE HRDepartment;

DROP TABLE HRDepartmentTable;


-- Завдання 4

-- Спроектуйте базу даних для системи відділу кадрів.


CREATE TABLE HRDepartmentTable(

id INT AUTO_INCREMENT NOT NULL,                              -- інкрементарний ід
-- ---------------------------------------------------
-- HR
Відповідальни_співробітник_відділу_HR VARCHAR(20),			 -- ПІБ фахівця HR
-- ---------------------------------------------------
-- Працівник
Дата_прийняття_на_Роботу VARCHAR(10),  					     -- дата коли було прийнято фахівця на роботу
Прізвище_працівника VARCHAR(20),							 -- Прізвище
Імя_працівника VARCHAR(20),									 -- Імя
По_батькові_працівника VARCHAR(20),							 -- Побатькові
Посада VARCHAR(30),                   					     -- Посада яку займає працівник
Стать VARCHAR(1),											 -- Стать працівника
Дата_народження VARCHAR(10),								 -- Дата народження рацівника
Наявність_дітей BOOLEAN,							    	 -- наявність дітей
Кількість_дітей_до_10_років INT NOT NULL,					 -- Кількість дітей
Номер_телефону VARCHAR(20),									 -- Номер телефону працівника

-- ---------------------------------------------------
-- Додаток
Безпосередній_керівник VARCHAR(20),							 -- ПІБ Керівника 
Департамент VARCHAR(50), 									 -- Структурний підрозділ куди прийнято працівника
ЗП_до_вирахування_податку DOUBLE NOT NULL,       				 -- Сумма заробітної плати
Необхідність_у_додаткових_днях_відпустки BOOLEAN,			 -- Додаткових 7 днів відпустки згідно КЗпП України
Дата_звільнення_з_роботи VARCHAR(10),  						 -- дата коли було звільнено фахівця з роботи
PRIMARY KEY(id)

);

INSERT INTO HRDepartmentTable
(Відповідальни_співробітник_відділу_HR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада, Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES 
('Оксана',   '01/01/2022',  'Агапов', 'Петро',    'Борисович',   'Frontend Dev.', 'Ч',  '12/03/1990', false, 7, '380976664422', 'Пяточкин П.В.', 'Технічний',         42348.00,    false, '00/00/0000'),
('Людмила',  '10/02/2021',  'Ющенко',  'Віктор',   'Андрійович',  'SQL Dev.',      'Ч',  '05/12/1980', true,  1, '380667778899', 'Пяточкин П.В.', 'Бsзнес аналітики',  17854.20,    true,  '00/00/0000'),
('Наталія',  '12/07/2016',  'Пяточкин','Петрик',   'Вадимович',   'CEO',           'Ч',  '12/03/1975', true,  2, '380113366777', 'Пяточкин П.В.', 'Технічний',         129713.00,   false, '00/00/0000'),
('Юлія',     '31/12/2001',  'Чипурко', 'Анастасія','Олегівна',    'System Arch.',  'Ж',  '17/07/1963', true,  2, '380097723613', 'Пяточкин П.В.', 'Технічний',         67999.00,    true,  '31/12/2023'),
('Людмила',  '11/02/2023',  'Іванова', 'Оксана',   'Юріївна',     'Frontend dev.', 'Ж',  '07/01/2000', true,  0, '380097799431', 'Пяточкин П.В.', 'Технічний',         17999.00,    false, '00/00/000');


SELECT * FROM HRDepartmentTable;



-- НА ОСНОВІ ДЗ №2 ВИКОНАВ НОРМАЛІЗАЦІЮ БАЗИ ДАНИХ 


CREATE TABLE AboutWorker(
idAW INT AUTO_INCREMENT NOT NULL, 
Прізвище_працівника VARCHAR(20),							 -- Прізвище
Імя_працівника VARCHAR(20),									 -- Імя
По_батькові_працівника VARCHAR(20),							 -- Побатькові
Посада VARCHAR(30),                   					     -- Посада яку займає працівник
PRIMARY KEY(idAW)
);

INSERT INTO AboutWorker
( Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада)
VALUES 
(  'Агапов',    'Петро',    'Борисович',   'Frontend Dev.'),
(  'Ющенко',    'Віктор',   'Андрійович',  'SQL Dev.'),
(  'Пяточкин',  'Петрик',   'Вадимович',   'CEO'),
(  'Чипурко',   'Анастасія','Олегівна',    'System Arch.'),
(  'Іванова',   'Оксана',   'Юріївна',     'Frontend dev.');

SELECT * FROM AboutWorker;
DROP TABLE AboutWorker;


CREATE TABLE ForHR(
idHR INT AUTO_INCREMENT NOT NULL,
Відповідальни_співробітник_відділу_HRName VARCHAR(20),	
Відповідальни_співробітник_відділу_HRSec VARCHAR(20),	
Відповідальни_співробітник_відділу_HRLAstName VARCHAR(20),	

Безпосередній_керівник VARCHAR(20),							 -- ПІБ Керівника 
Департамент VARCHAR(50), 									 -- Структурний підрозділ куди прийнято працівника
ЗП_до_вирахування_податку DOUBLE NOT NULL,       			 -- Сумма заробітної плати
Податок_на_дохід DOUBLE,       								 -- податок		
Необхідність_у_додаткових_днях_відпустки BOOLEAN,			 -- Додаткових 7 днів відпустки згідно КЗпП України
PRIMARY KEY(idHR),
FOREIGN KEY (idHR) REFERENCES AboutWorker (idAW)
);

INSERT INTO ForHR
(Відповідальни_співробітник_відділу_HRName ,Відповідальни_співробітник_відділу_HRSec, Відповідальни_співробітник_відділу_HRLastName, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Податок_на_дохід , Необхідність_у_додаткових_днях_відпустки)
VALUES
('Оксана', 'Петрівна',   'Курочкіна',  'Пяточкин П.В.',    'Технічний',         42348.00,  42348.00 * 0.20 ,   false),
('Людмила','Олегівна',   'Гусєва',     'Пяточкин П.В.',    'Бізнес аналітики',  17854.20,  17854.20 * 0.20 ,   true),
('Наталія','Альбертівна','Чайка',      'Пяточкин П.В.',    'Технічний',         129713.00, 129713.00 *  0.20 , false),
('Оксана', 'Петрівна',   'Курочкина',  'Пяточкин П.В.',    'Технічний',         67999.00,  67999.00 *  0.20 ,  true),
('Людмила','Олегівна',   'Гусєва',     'Пяточкин П.В.',    'Технічний',         17999.00,  17999.00 * 0.20 ,  false);


SELECT * FROM ForHR;
DROP TABLE ForHR;


CREATE TABLE OtherInformation(
idOI INT AUTO_INCREMENT NOT NULL, 
Дата_прийняття_на_Роботу VARCHAR(10),  					     -- дата коли було прийнято фахівця на роботу
Дата_звільнення_з_роботи VARCHAR(10),  						 -- дата коли було звільнено фахівця з роботи
Стать VARCHAR(1),											 -- Стать працівника
Дата_народження VARCHAR(10),								 -- Дата народження рацівника
Наявність_дітей BOOLEAN,							    	 -- наявність дітей
Кількість_дітей_до_10_років INT,					         -- Кількість дітей
Номер_телефону VARCHAR(30),	
PRIMARY KEY(idOI),
FOREIGN KEY (idOI) REFERENCES AboutWorker (idAW)
);

INSERT INTO OtherInformation 
(Дата_прийняття_на_Роботу,Дата_звільнення_з_роботи,Стать,Дата_народження,Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону)
VALUES 
('01/02/2021',  '00/00/0000',   'Ч',  '12/03/1990', true,  7, '380976664422'),
('10/02/2021',  '00/00/0000',   'Ч',  '05/12/1980', true,  1, '380667778899'),
('12/07/2016',  '00/00/0000',   'Ч',  '12/03/1975', true,  2, '380113366777'),
('31/12/2001',  '31/12/2023',   'Ж',  '17/07/1963', true,  2, '380097723613'),
('11/02/2023',  '00/00/0000',   'Ж',  '07/01/2000', false, 0, '380097799431');

SELECT * FROM OtherInformation;
DROP TABLE OtherInformation;

