package JavaEssential.Leason3.Task5;

public class Oracle {

//    https://docs.oracle.com/javase/tutorial/java/IandI/subclasses.html

/**

 Успадкування є основно складовою парадигмою в ООП.
 Мехахізм успадкування класів дозволяють створювати класи (дочірні) на основі вже створених (батьківських) класів і
 таким чином передавати всі властивості похідному класу.
 Даний механіз має свої як переваги так і недоліки :
  -  Перевагою є те що в новому дочірньому - похідному класі ми не створюємо дублюючі параметри , методи , а усвдковуємо
 їх з основного.

 - недоліками є те що при успадкуванні всі дані переносяться з (Батьківського) в (Дочірній) і таким чином ми навантажимо
 пам'ять , а також недолік в тому що множинне успадкування недозволено , але ми можемо успадкувати класи Ланцюгом і від останнього вже успадкуватись ,
 і таким чином ми можемо частово реалізувати множинне успадкування.

 UpCast та DownCast або приведення типів

 UpCast - це приведення екземпляру похідного класу до базового (тобто екземпляр Похідного класу використовуватиме конструктор Батьківського класу).
 DownCast - це приведення екземпляру базового класу до похідного (тобто екземпляр Похідного класу звертатиметься до конструктору батьківського класу але
 так само як і в приведенні примітивів ми ставитемемо вдужки і вказуватимемо екземпляр похідного класу(Похідний клсв) батьківський клас).

 Приватні члени батьківського класу
 Підклас не успадковує приватних членів свого батьківського класу.
 Однак, якщо суперклас має загальнодоступні або захищені методи доступу до своїх приватних полів (методи GET та SET)
 вони також можуть використовуватися і викликатись підкласом.

 Вкладений клас має доступ до всіх приватних членів класу, що його охоплює — як полів, так і методів.
 Тому публічний або захищений вкладений клас, успадкований підкласом, має непрямий доступ до всіх приватних членів суперкласу.


  **/
//    https://docs.oracle.com/javase/tutorial/java/javaOO/variables.html





}
