package JavaAdvance.Leason3;

public class Task3 {

    public static void main(String[] args) {


        String text = "Мотря махнула на себе хусточкою, сіла на призьбі й задумалася. Ілько, пильно слідкуючи за нею, \n " +
                "проти волі задивився на красу її, що тепер іще якось виразніше виявлялася на сірому тлі стіни, \n" +
                "— на ту красу, що не б’є у вічі, що на перший погляд ледве примітна, а тільки в неї вдивишся, можна впитися \n" +
                "й очима, і серцем, всею істотою. То була краса, що виховується тільки на Україні, але не така, як малюють деякі \n" +
                "з наших письменників. Не було в неї ні «губок, як пуп’янок, червоних, як добре намисто», \n" +
                "ні «підборіддя, як горішок», ні «щік, як повна рожа», і сама вона не «вилискувалась, як маківка на городі». \n" +
                "Чорна, без лиску, товста коса; невисокий, трохи випнутий лоб; ніс тонкий, рівний, з живими ніздрями; \n" +
                "свіжі, наче дитячі, губи, що якось мило загинались на кінцях; легка смага на матових, наче мармурових, \n" +
                "щоках і великі, надзвичайно великі, з довгими віями, темно-сірі очі, з яких здавалося, дивлячись, наче \n" +
                "лилося якесь тихе, м’яке, ласкаве світло, — то була й уся краса сієї дівчини (В. Винниченко). \n";

//        String text = "Bowers & Wilkins (B&W) — частная британская компания, производитель : акустических систем высокого класса, наушников и аудиосистем для автомобилей.";
//        System.out.println(text);

//        String[] split = text.split(":");
        String[] split = text.split("намисто");
        for (String Split : split) {
            System.out.println(Split);
        }
        System.out.println();
    }
}
